tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
brew "xz"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "python@3.12"
brew "cloudflared"
brew "cmake"
brew "fastfetch"
brew "icu4c@76"
brew "fortune"
brew "git"
brew "node"
brew "pkgconf"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rust"
brew "scrcpy"
brew "tcl-tk"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zbar"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "adguard"
cask "adguard-vpn"
cask "alacritty"
cask "android-file-transfer"
cask "android-platform-tools"
cask "buttercup"
cask "dbeaver-community"
cask "discord"
cask "font-blex-mono-nerd-font"
cask "font-d2coding"
cask "font-d2coding-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-pretendard"
cask "font-victor-mono"
cask "github"
cask "google-chrome"
cask "gstreamer-runtime"
cask "iterm2"
cask "jordanbaird-ice"
cask "macs-fan-control"
cask "microsoft-edge"
cask "oracle-jdk@21"
cask "orbstack"
cask "rectangle"
cask "swiftbar"
cask "trex"
cask "visual-studio-code"
cask "wine-stable"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
